app/views/entries/_comment.html.erb

  <div class="panel-heading">
    <h2>Comentarios (<%= @entry.comments.size %>)</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 1]]