app/controllers/comments_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    begin
      @entry = Entry.find(params[:entry_id])

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1313], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3543], ["LIMIT", 1]]
---
  def show
    begin
      @entry = Entry.find(params[:entry_id])
        begin
          @comment = Comment.find(params[:id])

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "comment", "entry_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Autor del comentario"], ["comment", "contenido del comentario"], ["entry_id", 1], ["created_at", "2018-04-03 03:40:31.897431"], ["updated_at", "2018-04-03 03:40:31.897431"]]
---
  def create
    author = params[:author]
    body = params[:comment]
    begin
      @entry = Entry.find(params[:entry_id])
      if @comment = @entry.comments.create(comment_params)

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
  def destroy
    begin
      @entry = Entry.find(params[:entry_id])
      begin
        @comment = Comment.find(params[:id])
        @comment.destroy

UPDATE "comments" SET "author" = $1, "entry_id" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["author", "Tomás"], ["entry_id", 1], ["updated_at", "2018-04-03 14:15:08.873050"], ["id", 13]]
---
  def update
    begin
      @entry = Entry.find(params[:entry_id])
      begin
        @comment = Comment.find(params[:id])
        if @comment.update(comment_params)