app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entries = Entry.GetAll
    @entries.each do |entry|

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    begin
      @entry = Entry.find(params[:id])

INSERT INTO "entries" ("title", "subhead", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Noticia 2"], ["subhead", "Bajada de Noticia 2"], ["body", "Cuerpo de Noticia 2"], ["created_at", "2018-03-19 06:46:42.632457"], ["updated_at", "2018-03-19 06:46:42.632457"]]
---
  def create

    id = params[:id]

    if id
      output = {:error => "Can't create an entry with that id"}
    else
      if @entry = Entry.create(entry_params)

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 2]]
---
  def destroy
    begin
      @entry = Entry.find(params[:id])
      @entry.destroy

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "entries" SET "subtitle" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["subtitle", "Nuevo Subtítulo de la noticia"], ["updated_at", "2018-04-03 15:37:27.089069"], ["id", 1]]
---
  def update
    begin
      @entry = Entry.find(params[:id])
      if @entry.update(entry_params)